settings.org
Literate Emacs init file using org babel

* Packages

#+BEGIN_SRC emacs-lisp
(package-initialize nil)
(add-to-list 'package-archives
             '("org" . "http://orgmode.org/elpa/"))
(add-to-list 'package-archives
             '("melpa" . "http://melpa.org/packages/") t)
(add-to-list 'package-archives
             '("marmalade" . "https://marmalade-repo.org/packages/"))
(add-to-list 'package-archives
             '("tromey" . "http://tromey.com/elpa/") t)
(setq package-archive-priorities '(("org" . 5)
                                   ("melpa" . 4)
                                   ("marmalade" . 3)
                                   ("tromey" . 2)
                                   ("gnu" . 1)))
(unless (package-installed-p 'use-package)  (package-refresh-contents)
  (package-install 'use-package))
(setq use-package-verbose t)
(eval-when-compile
  (require 'use-package))
(use-package diminish :ensure t)
#+END_SRC


* Appearance

#+BEGIN_SRC emacs-lisp

(setq inhibit-splash-screen t)

(global-visual-line-mode t)

(add-to-list 'load-path "~/.emacs.d/vendor/powerline")
(require 'powerline)
(powerline-center-theme)

(menu-bar-mode -1)

(global-linum-mode t)

(setq linum-format "%4d\u2502")

#+END_SRC


* Org 

#+BEGIN_SRC emacs-lisp -n
  (with-eval-after-load 'org

     (setq org-support-shift-select t)

     ;; Use Kaligule's fork of org-bullets due to issues the official melpa release has with org-hide as of 2018/04/01

     (add-to-list 'load-path "~/.emacs.d/vendor/org-bullets")
     (require 'org-bullets)
     (add-hook 'org-mode-hook (lambda() (org-bullets-mode 1)))

     ;; (use-package org-bullets
     ;;   :ensure t
     ;;   :commands (org-bullets-mode)
     ;;   :init (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

     (setq org-startup-indented t)

     (setq org-hide-leading-stars t))

     (org-add-hook 'org-src-mode-hook 'linum-mode*)

     (org-babel-do-load-languages 
        'org-babel-load-languages
        '( (perl . t)
           (ruby . t)
           (sh . t)
           (python . t)
           (emacs-lisp . t)
           (R . t)
           (haskell . t)
           (clojure . t)
           (scheme . t)
      )
  )


#+END_SRC


* Emacs Custom
Direct Emacs to use custom.el for storing customized settings instead of init.el.

#+BEGIN_SRC emacs-lisp

(setq custom-file "~/.emacs.d/custom.el")
(load custom-file)

#+END_SRC


